# Data Analysis library
- This library are used for performing manipulation on the data
- The various data analysis library are :
    1. Numpy
    2. Pandas
    3. Matplotlib
    4. Sklearn
    5. Seaborn 
    
## Numpy
- Numpy stands for numerical python.
- Numpy library is used to solve complex mathematical problems.
- Using the numpy library we can represent data in matrix form.
- Numpy is used to perform statistical operation such as mean, mean square value, standard deviation, variance,etc

## Pandas
- Pandas is one of library in python which is used to perform data analysis and manipulation.
- Data analysis operation such as cleaning, processing, modelling, inspecting the data
- Data manipulation such as adding the data deleting the data and applying modification to data
- Pandas libraries are used to reduce the complexity and make work easier.

## Matplotlib
- This library is used to represent our data in graphical form
- The graphical or pictorial representation will be helpful to understand the application.

In [1]:
import pandas as pd
d = {"Names":["Krishna","Raju","Rani"],"RNO":[101,102,103],
     "Maths":[67,78,89],"English":[56,67,45],"Physics":[78,89,90]}
df = pd.DataFrame(d)
df

     Names  RNO  Maths  English  Physics
0  Krishna  101     67       56       78
1     Raju  102     78       67       89
2     Rani  103     89       45       90

In [2]:
df.columns

Index(['Names', 'RNO', 'Maths', 'English', 'Physics'], dtype='object')

In [3]:
df.shape

(3, 5)

In [4]:
df[["Names"]]

     Names
0  Krishna
1     Raju
2     Rani

In [5]:
df[["Names","English"]]

     Names  English
0  Krishna       56
1     Raju       67
2     Rani       45

In [6]:
df.head(1)

     Names  RNO  Maths  English  Physics
0  Krishna  101     67       56       78

In [7]:
df[1:2]

  Names  RNO  Maths  English  Physics
1  Raju  102     78       67       89

In [8]:
s = {"Names":"Srinu","RNO":104,"Maths":67,"English":56,"Physics":78}
df = df._append(s,ignore_index=True)
df

     Names  RNO  Maths  English  Physics
0  Krishna  101     67       56       78
1     Raju  102     78       67       89
2     Rani  103     89       45       90
3    Srinu  104     67       56       78

In [9]:
s2 = {"Names":"Kshitij","RNO":105,"Maths":78,"English":67,"Physics":77}
df = df._append(s2,ignore_index=True)
df

     Names  RNO  Maths  English  Physics
0  Krishna  101     67       56       78
1     Raju  102     78       67       89
2     Rani  103     89       45       90
3    Srinu  104     67       56       78
4  Kshitij  105     78       67       77

In [11]:
df['Telegu']=[60,56,87,95,57]
df

     Names  RNO  Maths  English  Physics  Telegu
0  Krishna  101     67       56       78      60
1     Raju  102     78       67       89      56
2     Rani  103     89       45       90      87
3    Srinu  104     67       56       78      95
4  Kshitij  105     78       67       77      57

---
## iloc,loc (Index based location)
- The iloc is fully based on index position that is we have to mention both row and columns information in index only.
- loc we can access the data using the name field or column field.

In [12]:
df.loc[1:3]

   Names  RNO  Maths  English  Physics  Telegu
1   Raju  102     78       67       89      56
2   Rani  103     89       45       90      87
3  Srinu  104     67       56       78      95

In [14]:
df.loc[:3]

     Names  RNO  Maths  English  Physics  Telegu
0  Krishna  101     67       56       78      60
1     Raju  102     78       67       89      56
2     Rani  103     89       45       90      87
3    Srinu  104     67       56       78      95

In [17]:
df.loc[1:3,'Names':"Maths"]

   Names  RNO  Maths
1   Raju  102     78
2   Rani  103     89
3  Srinu  104     67

In [22]:
df.loc[2:3,'Physics':'Telegu']

   Physics  Telegu
2       90      87
3       78      95

In [29]:
df.iloc[[4]]

     Names  RNO  Maths  English  Physics  Telegu
4  Kshitij  105     78       67       77      57

In [32]:
df.iloc[1:4]

   Names  RNO  Maths  English  Physics  Telegu
1   Raju  102     78       67       89      56
2   Rani  103     89       45       90      87
3  Srinu  104     67       56       78      95

In [35]:
df.iloc[1:3,1:3]

   RNO  Maths
1  102     78
2  103     89

In [36]:
df.iloc[2:5,2:5]

   Maths  English  Physics
2     89       45       90
3     67       56       78
4     78       67       77

In [93]:
mat = [[1,1,0,0,0],[1,1,1,1,0],[1,0,0,0,0],[1,1,0,0,0],[1,1,1,1,1]]
k = 3
ans = []

for i in mat:
    ans.append(sum(i))


result = []
for i in ans:
    result.append(i)

ans.sort()
print(result)
print(ans)

final = []

for i in range(k):

    nth = result.index(ans[i])
    final.append(result.index(ans[i]))
    result[nth] =100**100
print(final)

[2, 4, 1, 2, 5]
[1, 2, 2, 4, 5]
[2, 0, 3]

In [95]:
arr = [(sum(mat[i]),i) for i in range(len(mat))]
arr.sort()
print( [arr[i][1] for i in range(k)])

[2, 0, 3]

In [ ]:
Given an integer n, return a string array answer (1-indexed) where:

answer[i] == "FizzBuzz" if i is divisible by 3 and 5.
answer[i] == "Fizz" if i is divisible by 3.
answer[i] == "Buzz" if i is divisible by 5.
answer[i] == i (as a string) if none of the above conditions are true.
 

Example 1:

Input: n = 3
Output: ["1","2","Fizz"]
Example 2:

Input: n = 5
Output: ["1","2","Fizz","4","Buzz"]
Example 3:

Input: n = 15
Output: ["1","2","Fizz","4","Buzz","Fizz","7","8","Fizz","Buzz","11","Fizz","13","14","FizzBuzz"]

In [105]:
n = int(input())
arr=[]
for i in range(1,n+1):
    if i%3==0 and i%5==0:
        arr.append("FizzBuzz")
    elif i%3==0:
        arr.append("Fizz")
    elif i%5==0:
        arr.append("Buzz")
    else:
        arr.append(str(i))
print(arr)

3
['1', '2', 'Fizz']

In [154]:
import math
n = 3

x=math.log2(n)
# print(x)
if x:
    print(True)
else:
    print(False)

True

######

In [187]:
nums = [2,2,1,1,1,2,2]
d = dict()
for i in nums:
    d[nums.count(i)]=i

arr=[]
for p,q in d.items():
    arr.append(p)
    
m = max(arr)
print(d[m])

2